// Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).

// 4 -> да
// -3 -> нет
// 7 -> нет

int value = 44;
if (value%2 != 0)
    Console.WriteLine(value + " - не четное число");
else
    Console.WriteLine(value + " - четное число");
//Console.WriteLine(value/2);


